GHB2/src/Documents/гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения/гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения</name>
  <registerRecords>InformationRegister.гхб_ОтветственныеЗаКонсервациюПомещений</registerRecords>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>СуществующийДоступ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйЗаКонсервациюПомещения</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаКонсервациюПомещений/гхб_ОтветственныеЗаКонсервациюПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаКонсервациюПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственныйЗаКонсервациюПомещения</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ДополнительныеСвойстваПомещений/гхб_ДополнительныеСвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ДополнительныеСвойстваПомещений</name>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныеЗаКонсервациюПомещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныеЗаПожарнуюБезопасность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) 
	   И РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
	   
	   	Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
		
		ДвиженияПоЗакреплениюОтветственныхЗаКонсервациюПомещений();
		
		РегистрыСведений.гхб_СобытияОбъектовБД.ЗаписатьДанныеСобытияОбъекта(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента);
		
		ЗаполнитьОтветственныхЗаКонсервациюПомещенийВДополнительно();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоЗакреплениюОтветственныхЗаКонсервациюПомещений()
	
	Для Каждого Стр Из Помещения Цикл
		
		Если (Стр.СуществующийДоступ И Стр.Закрыть) ИЛИ (НЕ Стр.СуществующийДоступ И НЕ Стр.Закрыть) Тогда
		
			_Строка = Движения.гхб_ОтветственныеЗаКонсервациюПомещений.Добавить();
			_Строка.Период = Дата;
			_Строка.Регистратор = Ссылка;
			_Строка.Помещение = Стр.Помещение;
			_Строка.ОтветственныйЗаКонсервациюПомещения = Стр.ОтветственныйЗаКонсервациюПомещения;
			_Строка.Закрыть = Стр.Закрыть;
		
		КонецЕсли;
		
	КонецЦикла;
		
	Движения.гхб_ОтветственныеЗаКонсервациюПомещений.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьОтветственныхЗаКонсервациюПомещенийВДополнительно()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних.Помещение КАК Помещение
	               |ПОМЕСТИТЬ _Помещения
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаКонсервациюПомещений.СрезПоследних КАК гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних
	               |ГДЕ
	               |	гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних.Регистратор = &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних.Помещение
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних.Помещение КАК Помещение,
	               |	гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних.ОтветственныйЗаКонсервациюПомещения КАК ОтветственныйЗаКонсервациюПомещения,
	               |	гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних.Закрыть КАК Закрыть
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаКонсервациюПомещений.СрезПоследних КАК гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Помещения КАК _Помещения
	               |		ПО гхб_ОтветственныеЗаКонсервациюПомещенийСрезПоследних.Помещение = _Помещения.Помещение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Помещение,
	               |	ОтветственныйЗаКонсервациюПомещения
	               |ИТОГИ ПО
	               |	Помещение
	               |АВТОУПОРЯДОЧИВАНИЕ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ _Помещения";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ВыборкаПомещения = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПомещения.Следующий() Цикл
		
		_Стр = "";
		
		ВыборкаОтветственные = ВыборкаПомещения.Выбрать();
		
		Пока ВыборкаОтветственные.Следующий() Цикл
			Если НЕ ВыборкаОтветственные.Закрыть Тогда
				_Стр = _Стр + ?(ЗначениеЗаполнено(_Стр), "; ", "") + СокрЛП(ВыборкаОтветственные.ОтветственныйЗаКонсервациюПомещения);
			КонецЕсли;
		КонецЦикла;
		
		МЗ = РегистрыСведений.гхб_ДополнительныеСвойстваПомещений.СоздатьМенеджерЗаписи();
		МЗ.Помещение = ВыборкаПомещения.Помещение;
		МЗ.Прочитать();
		
		МЗ.Помещение = ВыборкаПомещения.Помещение;
		МЗ.ОтветственныеЗаКонсервациюПомещения = _Стр;
		МЗ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
